docs/artifacts/k6-results-load.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: infra/loadtest/k6/habit-tracker.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m0s max duration (incl. graceful stop):
              * smoke: 5 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
smoke   [   3% ] 5 VUs  01.0s/30s

running (0m02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
smoke   [   7% ] 5 VUs  02.0s/30s

running (0m03.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
smoke   [  10% ] 5 VUs  03.0s/30s

running (0m04.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
smoke   [  13% ] 5 VUs  04.0s/30s

running (0m05.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
smoke   [  17% ] 5 VUs  05.0s/30s

running (0m06.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
smoke   [  20% ] 5 VUs  06.0s/30s

running (0m07.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
smoke   [  23% ] 5 VUs  07.0s/30s

running (0m08.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
smoke   [  27% ] 5 VUs  08.0s/30s

running (0m09.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
smoke   [  30% ] 5 VUs  09.0s/30s

running (0m10.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
smoke   [  33% ] 5 VUs  10.0s/30s

running (0m11.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
smoke   [  37% ] 5 VUs  11.0s/30s

running (0m12.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
smoke   [  40% ] 5 VUs  12.0s/30s

running (0m13.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
smoke   [  43% ] 5 VUs  13.0s/30s

running (0m14.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
smoke   [  47% ] 5 VUs  14.0s/30s

running (0m15.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
smoke   [  50% ] 5 VUs  15.0s/30s

running (0m16.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
smoke   [  53% ] 5 VUs  16.0s/30s

running (0m17.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
smoke   [  57% ] 5 VUs  17.0s/30s

running (0m18.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
smoke   [  60% ] 5 VUs  18.0s/30s

running (0m19.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
smoke   [  63% ] 5 VUs  19.0s/30s

running (0m20.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
smoke   [  67% ] 5 VUs  20.0s/30s

running (0m21.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
smoke   [  70% ] 5 VUs  21.0s/30s

running (0m22.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
smoke   [  73% ] 5 VUs  22.0s/30s

running (0m23.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
smoke   [  77% ] 5 VUs  23.0s/30s

running (0m24.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
smoke   [  80% ] 5 VUs  24.0s/30s

running (0m25.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
smoke   [  83% ] 5 VUs  25.0s/30s

running (0m26.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
smoke   [  87% ] 5 VUs  26.0s/30s

running (0m27.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
smoke   [  90% ] 5 VUs  27.0s/30s

running (0m28.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
smoke   [  93% ] 5 VUs  28.0s/30s

running (0m29.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
smoke   [  97% ] 5 VUs  29.0s/30s

running (0m30.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
smoke   [ 100% ] 5 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<800' p(95)=246.62ms

    http_req_failed
    ✗ 'rate<0.01' rate=25.00%


  █ TOTAL RESULTS 

    checks_total.......: 400    13.029751/s
    checks_succeeded...: 75.00% 300 out of 400
    checks_failed......: 25.00% 100 out of 400

    ✓ health 200
    ✓ list habits 200
    ✗ log completion 201/200
      ↳  0% — ✓ 0 / ✗ 100
    ✓ leaderboard 200

    HTTP
    http_req_duration..............: avg=131.66ms min=22.17ms med=134.13ms max=646.21ms p(90)=228.43ms p(95)=246.62ms
      { expected_response:true }...: avg=143.73ms min=22.17ms med=156.85ms max=646.21ms p(90)=234.82ms p(95)=251.05ms
    http_req_failed................: 25.00% 100 out of 400
    http_reqs......................: 400    13.029751/s

    EXECUTION
    iteration_duration.............: avg=1.53s    min=1.43s   med=1.5s     max=2.08s    p(90)=1.55s    p(95)=1.59s   
    iterations.....................: 100    3.257438/s
    vus............................: 5      min=5          max=5
    vus_max........................: 5      min=5          max=5

    NETWORK
    data_received..................: 187 kB 6.1 kB/s
    data_sent......................: 33 kB  1.1 kB/s



running (0m30.7s), 0/5 VUs, 100 complete and 0 interrupted iterations
smoke ✓ [ 100% ] 5 VUs  30s